RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpi2c_cmsis.c
/*
 * Copyright (c) 2013-2016 ARM Limited. All rights reserved.
 * Copyright (c) 2016, Freescale Semiconductor, Inc. Not a Contribution.
 * Copyright 2016-2017,2020,2024-2025 NXP. Not a Contribution.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "fsl_lpi2c_cmsis.h"

#if ((defined(RTE_I2C0) && RTE_I2C0 && (defined(LPI2C0) || defined(LPI2C_0))) || (defined(RTE_I2C1) && RTE_I2C1 && (defined(LPI2C1) || defined(LPI2C_1))) ||       \
     (defined(RTE_I2C2) && RTE_I2C2 && (defined(LPI2C2) || defined(LPI2C_2))) || (defined(RTE_I2C3) && RTE_I2C3 && (defined(LPI2C3) || defined(LPI2C_3))) ||       \
     (defined(RTE_I2C4) && RTE_I2C4 && (defined(LPI2C4) || defined(LPI2C_4))) || (defined(RTE_I2C5) && RTE_I2C5 && (defined(LPI2C5) || defined(LPI2C_5))) ||       \
     (defined(RTE_I2C6) && RTE_I2C6 && (defined(LPI2C6) || defined(LPI2C_6))) || (defined(RTE_I2C7) && RTE_I2C7 && (defined(LPI2C7) || defined(LPI2C_7))) ||       \
     (defined(RTE_I2C8) && RTE_I2C8 && (defined(LPI2C8) || defined(LPI2C_8))) || (defined(RTE_I2C9) && RTE_I2C9 && (defined(LPI2C9) || defined(LPI2C_9))) ||       \
     (defined(RTE_I2C10) && RTE_I2C10 && (defined(LPI2C10) || defined(LPI2C_10))) || (defined(RTE_I2C11) && RTE_I2C11 && (defined(LPI2C11) || defined(LPI2C_11))) || \
     (defined(RTE_I2C12) && RTE_I2C12 && (defined(LPI2C12) || defined(LPI2C_12))) || (defined(RTE_I2C13) && RTE_I2C13 && (defined(LPI2C13) || defined(LPI2C_13))) || \
     (defined(RTE_I2C14) && RTE_I2C14 && (defined(LPI2C14) || defined(LPI2C_14))) || (defined(RTE_I2C15) && RTE_I2C15 && (defined(LPI2C15) || defined(LPI2C_15))) || \
     (defined(RTE_I2C16) && RTE_I2C16 && (defined(LPI2C16) || defined(LPI2C_16))) || (defined(RTE_I2C17) && RTE_I2C17 && (defined(LPI2C17) || defined(LPI2C_17))) || \
     (defined(RTE_I2C18) && RTE_I2C18 && (defined(LPI2C18) || defined(LPI2C_18))) || (defined(RTE_I2C19) && RTE_I2C19 && (defined(LPI2C19) || defined(LPI2C_19))) || \
     (defined(RTE_I2C20) && RTE_I2C20 && (defined(LPI2C20) || defined(LPI2C_20))))

#define ARM_LPI2C_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR((2), (6))

/*
 * ARMCC does not support split the data section automatically, so the driver
 * needs to split the data to separate sections explicitly, to reduce codesize.
 */
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
#define ARMCC_SECTION(section_name) __attribute__((section(section_name)))
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpi2c_cmsis"
#endif

typedef const struct _cmsis_lpi2c_resource
{
    LPI2C_Type *base;          /*!< LPI2C peripheral base address.      */
    uint32_t (*GetFreq)(void); /*!< Function to get the clock frequency. */

} cmsis_lpi2c_resource_t;

typedef union _cmsis_i2c_handle
{
    lpi2c_master_handle_t master_handle;
    lpi2c_slave_handle_t slave_handle;
} cmsis_i2c_handle_t;

typedef struct _cmsis_lpi2c_interrupt_driver_state
{
    cmsis_lpi2c_resource_t *resource; /*!< Basic LPI2C resource. */
    cmsis_i2c_handle_t *handle;
    uint8_t *slave_data;              /*!< slave Transfer buffer */
    size_t slave_dataSize;            /*!< slave Transfer size */
    ARM_I2C_SignalEvent_t cb_event;   /*!< call back function */
    uint8_t flags;                    /*!< Control and state flags. */
} cmsis_lpi2c_interrupt_driver_state_t;

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
typedef const struct _cmsis_lpi2c_edma_resource
{
    void *txEdmaBase;          /*!< EDMA peripheral base address for Tx.  */
    uint32_t txEdmaChannel;    /*!< EDMA channel for Tx                   */
    uint16_t txDmaRequest;     /*!< Tx EDMA request source.               */

    void *rxEdmaBase;          /*!< EDMA peripheral base address for Rx.  */
    uint32_t rxEdmaChannel;    /*!< EDMA channel for Rx                   */
    uint16_t rxDmaRequest;     /*!< Rx EDMA request source.               */
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    DMAMUX_Type *txDmamuxBase; /*!< DMAMUX peripheral base address for Tx */
    DMAMUX_Type *rxDmamuxBase; /*!< DMAMUX peripheral base address for Rx */
#endif
} cmsis_lpi2c_edma_resource_t;

typedef struct _cmsis_lpi2c_edma_driver_state
{
    cmsis_lpi2c_resource_t *resource;               /*!< lpi2c basic resource.       */
    cmsis_lpi2c_edma_resource_t *edmaResource;      /*!< lpi2c EDMA resource.        */
    lpi2c_master_edma_handle_t *master_edma_handle; /*!< lpi2c EDMA transfer handle. */
    edma_handle_t *edmaTxHandle;                    /*!< EDMA lpi2c Tx handle.       */
    edma_handle_t *edmaRxHandle;                    /*!< EDMA lpi2c Rx handle.       */
    uint8_t flags;                                  /*!< Control and state flags. */
} cmsis_lpi2c_edma_driver_state_t;
#endif                                              /* FSL_FEATURE_SOC_EDMA_COUNT */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static const ARM_DRIVER_VERSION s_lpi2cDriverVersion        = {ARM_I2C_API_VERSION, ARM_LPI2C_DRV_VERSION};
static const ARM_I2C_CAPABILITIES s_lpi2cDriverCapabilities = {
    0, /* Do not support 10-bit addressing.*/
};

