RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/cmsis_drivers/fsl_lpi2c_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c9_edma_driver_state")
static cmsis_lpi2c_edma_driver_state_t LPI2C9_EdmaDriverState = {
#else
static cmsis_lpi2c_edma_driver_state_t LPI2C9_EdmaDriverState = {
#endif
    &LPI2C9_Resource, &LPI2C9_EdmaResource, &LPI2C9_EdmaHandle, &LPI2C9_EdmaTxHandle, &LPI2C9_EdmaRxHandle,
};

static int32_t LPI2C9_Master_EdmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C9_PIN_INIT
    RTE_I2C9_PIN_INIT();
#endif
    return LPI2C_Master_EdmaInitialize(cb_event, &LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaUninitialize(void)
{
#ifdef RTE_I2C9_PIN_DEINIT
    RTE_I2C9_PIN_DEINIT();
#endif
    return LPI2C_Master_EdmaUninitialize(&LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_Master_EdmaPowerControl(state, &LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaTransmit(addr, data, num, xfer_pending, &LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaReceive(addr, data, num, xfer_pending, &LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaGetDataCount(void)
{
    return LPI2C_Master_EdmaGetDataCount(&LPI2C9_EdmaDriverState);
}

static int32_t LPI2C9_Master_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPI2C_Master_EdmaControl(control, arg, &LPI2C9_EdmaDriverState);
}

static ARM_I2C_STATUS LPI2C9_Master_EdmaGetStatus(void)
{
    return LPI2C_Master_EdmaGetStatus(&LPI2C9_EdmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t LPI2C9_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c9_interrupt_driver_state")
static cmsis_lpi2c_interrupt_driver_state_t LPI2C9_InterruptDriverState = {
#else
static cmsis_lpi2c_interrupt_driver_state_t LPI2C9_InterruptDriverState = {
#endif
    &LPI2C9_Resource,
    &LPI2C9_Handle,
};

static void KSDK_LPI2C9_SLAVE_InterruptCallback(LPI2C_Type *base, lpi2c_slave_transfer_t *xfer, void *userData)
{
    KSDK_LPI2C_SLAVE_InterruptCallback(base, xfer, userData, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C9_PIN_INIT
    RTE_I2C9_PIN_INIT();
#endif
    return LPI2C_InterruptInitialize(cb_event, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_InterruptUninitialize(void)
{
#ifdef RTE_I2C9_PIN_DEINIT
    RTE_I2C9_PIN_DEINIT();
#endif
    return LPI2C_InterruptUninitialize(&LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_InterruptPowerControl(state, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptReceive(addr, data, num, xfer_pending, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    LPI2C9_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C9_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptTransmit(data, num, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    LPI2C9_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C9_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptReceive(data, num, &LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_InterruptGetDataCount(void)
{
    return LPI2C_InterruptGetDataCount(&LPI2C9_InterruptDriverState);
}

static int32_t LPI2C9_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPI2C_InterruptControl(control, arg, &LPI2C9_InterruptDriverState);
}

static ARM_I2C_STATUS LPI2C9_InterruptGetStatus(void)
{
    return LPI2C_InterruptGetStatus(&LPI2C9_InterruptDriverState);
}

#endif /* RTE_I2C9_DMA_EN */

ARM_DRIVER_I2C Driver_I2C9 = {LPI2Cx_GetVersion,
                              LPI2Cx_GetCapabilities,
#if defined(RTE_I2C9_DMA_EN) && RTE_I2C9_DMA_EN
                              LPI2C9_Master_EdmaInitialize,
                              LPI2C9_Master_EdmaUninitialize,
                              LPI2C9_Master_EdmaPowerControl,
                              LPI2C9_Master_EdmaTransmit,
                              LPI2C9_Master_EdmaReceive,
                              NULL,
                              NULL,
                              LPI2C9_Master_EdmaGetDataCount,
                              LPI2C9_Master_EdmaControl,
                              LPI2C9_Master_EdmaGetStatus
#else
                              LPI2C9_InterruptInitialize,
                              LPI2C9_InterruptUninitialize,
                              LPI2C9_InterruptPowerControl,
                              LPI2C9_Master_InterruptTransmit,
                              LPI2C9_Master_InterruptReceive,
                              LPI2C9_Slave_InterruptTransmit,
                              LPI2C9_Slave_InterruptReceive,
                              LPI2C9_InterruptGetDataCount,
                              LPI2C9_InterruptControl,
                              LPI2C9_InterruptGetStatus
#endif /* RTE_I2C9_DMA_EN */
};

#endif /* LPI2C9 */

#if (defined(LPI2C10) || defined(LPI2C_10)) && defined(RTE_I2C10) && RTE_I2C10
/* User needs to provide the implementation for LPI2C10_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPI2C10_GetFreq(void);

#if defined(LPI2C10)
static cmsis_lpi2c_resource_t LPI2C10_Resource = {LPI2C10, LPI2C10_GetFreq};
#elif defined(LPI2C_10)
static cmsis_lpi2c_resource_t LPI2C10_Resource = {LPI2C_10, LPI2C10_GetFreq};
#endif

